GT3/setup_TM/LES-wale/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{
turbulence on;

//LESModel        homogeneousDynSmagorinsky;
LESModel        Smagorinsky;
//LESModel        WALE;

/*
DeardorffDiffStress
Smagorinsky
SpalartAllmarasDDES
SpalartAllmarasDES
SpalartAllmarasIDDES
WALE
dynamicKEqn
dynamicLagrangian
kEqn
kOmegaSSTDES
*/

//delta           cubeRootVol;
delta           vanDriest;

/*
IDDESDelta
Prandtl
cubeRootVol
maxDeltaxyz
smooth
vanDriest
*/

printCoeffs     on;

cubeRootVolCoeffs
{
    deltaCoeff      1;
}

PrandtlCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }

        maxDeltaRatio   1.1;
    }

    Cdelta          0.158;
}

vanDriestCoeffs
{
    //delta           cubeRootVol;
    delta           smooth;

    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    smoothCoeffs
    {
        delta           cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }

        maxDeltaRatio   1.1;
    }

    //Aplus           26;
    //Cdelta          0.158;

}

smoothCoeffs
{
    delta           cubeRootVol;
    cubeRootVolCoeffs
    {
        deltaCoeff      1;
    }

    maxDeltaRatio   1.1;
}

dynOneEqEddyCoeffs
{
  filter  simple;
// 	  anisotropic
// 	  laplace
// 	  simple 
  
  cd 1.048;
}

homogeneousDynSmagorinskyCoeffs
{
  filter  simple;
// 	  anisotropic
// 	  laplace
// 	  simple
  cd 1.048;
}

}

// ************************************************************************* //
